FPR_EVIDENCE_23090383/05_K6_RAW/SPRING_BOOT/EV-K6-SB-SMOKE-VU1-W1-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: testing/k6/smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 10 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m01.0s/10m0s  00/10 shared iters

running (00m02.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  00m02.0s/10m0s  01/10 shared iters

running (00m03.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  00m03.0s/10m0s  02/10 shared iters

running (00m04.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  00m04.0s/10m0s  03/10 shared iters

running (00m05.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  00m05.0s/10m0s  04/10 shared iters

running (00m06.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  00m06.0s/10m0s  05/10 shared iters

running (00m07.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  00m07.0s/10m0s  06/10 shared iters

running (00m08.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  00m08.0s/10m0s  07/10 shared iters

running (00m09.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  00m09.0s/10m0s  08/10 shared iters

running (00m10.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  00m10.0s/10m0s  09/10 shared iters


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=13.81ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 10      0.993803/s
    checks_succeeded...: 100.00% 10 out of 10
    checks_failed......: 0.00%   0 out of 10

    ✓ ping status 200

    HTTP
    http_req_duration..............: avg=4.46ms min=1.67ms med=2.53ms max=21.26ms p(90)=6.35ms p(95)=13.81ms
      { expected_response:true }...: avg=4.46ms min=1.67ms med=2.53ms max=21.26ms p(90)=6.35ms p(95)=13.81ms
    http_req_failed................: 0.00%  0 out of 10
    http_reqs......................: 10     0.993803/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s     med=1s     max=1.02s   p(90)=1s     p(95)=1.01s  
    iterations.....................: 10     0.993803/s
    vus............................: 1      min=1       max=1
    vus_max........................: 1      min=1       max=1

    NETWORK
    data_received..................: 2.7 kB 272 B/s
    data_sent......................: 780 B  78 B/s



running (00m10.1s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  00m10.1s/10m0s  10/10 shared iters